{
  "char_to_idx": {
    "<PAD>": 0,
    "<BOS>": 1,
    "<EOS>": 2,
    "a": 3,
    "b": 4,
    "c": 5,
    "d": 6,
    "e": 7,
    "f": 8,
    "g": 9,
    "h": 10,
    "i": 11,
    "j": 12,
    "k": 13,
    "l": 14,
    "m": 15,
    "n": 16,
    "o": 17,
    "p": 18,
    "q": 19,
    "r": 20,
    "s": 21,
    "t": 22,
    "u": 23,
    "v": 24,
    "w": 25,
    "x": 26,
    "y": 27,
    "z": 28,
    "A": 29,
    "B": 30,
    "C": 31,
    "D": 32,
    "E": 33,
    "F": 34,
    "G": 35,
    "H": 36,
    "I": 37,
    "J": 38,
    "K": 39,
    "L": 40,
    "M": 41,
    "N": 42,
    "O": 43,
    "P": 44,
    "Q": 45,
    "R": 46,
    "S": 47,
    "T": 48,
    "U": 49,
    "V": 50,
    "W": 51,
    "X": 52,
    "Y": 53,
    "Z": 54,
    "0": 55,
    "1": 56,
    "2": 57,
    "3": 58,
    "4": 59,
    "5": 60,
    "6": 61,
    "7": 62,
    "8": 63,
    "9": 64,
    "!": 65,
    "\"": 66,
    "#": 67,
    "$": 68,
    "%": 69,
    "&": 70,
    "'": 71,
    "(": 72,
    ")": 73,
    "*": 74,
    "+": 75,
    ",": 76,
    "-": 77,
    ".": 78,
    "/": 79,
    ":": 80,
    ";": 81,
    "<": 82,
    "=": 83,
    ">": 84,
    "?": 85,
    "@": 86,
    "[": 87,
    "\\": 88,
    "]": 89,
    "^": 90,
    "_": 91,
    "`": 92,
    "{": 93,
    "|": 94,
    "}": 95,
    "~": 96
  },
  "idx_to_char": {
    "0": "<PAD>",
    "1": "<BOS>",
    "2": "<EOS>",
    "3": "a",
    "4": "b",
    "5": "c",
    "6": "d",
    "7": "e",
    "8": "f",
    "9": "g",
    "10": "h",
    "11": "i",
    "12": "j",
    "13": "k",
    "14": "l",
    "15": "m",
    "16": "n",
    "17": "o",
    "18": "p",
    "19": "q",
    "20": "r",
    "21": "s",
    "22": "t",
    "23": "u",
    "24": "v",
    "25": "w",
    "26": "x",
    "27": "y",
    "28": "z",
    "29": "A",
    "30": "B",
    "31": "C",
    "32": "D",
    "33": "E",
    "34": "F",
    "35": "G",
    "36": "H",
    "37": "I",
    "38": "J",
    "39": "K",
    "40": "L",
    "41": "M",
    "42": "N",
    "43": "O",
    "44": "P",
    "45": "Q",
    "46": "R",
    "47": "S",
    "48": "T",
    "49": "U",
    "50": "V",
    "51": "W",
    "52": "X",
    "53": "Y",
    "54": "Z",
    "55": "0",
    "56": "1",
    "57": "2",
    "58": "3",
    "59": "4",
    "60": "5",
    "61": "6",
    "62": "7",
    "63": "8",
    "64": "9",
    "65": "!",
    "66": "\"",
    "67": "#",
    "68": "$",
    "69": "%",
    "70": "&",
    "71": "'",
    "72": "(",
    "73": ")",
    "74": "*",
    "75": "+",
    "76": ",",
    "77": "-",
    "78": ".",
    "79": "/",
    "80": ":",
    "81": ";",
    "82": "<",
    "83": "=",
    "84": ">",
    "85": "?",
    "86": "@",
    "87": "[",
    "88": "\\",
    "89": "]",
    "90": "^",
    "91": "_",
    "92": "`",
    "93": "{",
    "94": "|",
    "95": "}",
    "96": "~"
  }
}